<?php
    // 電卓アプリ

    // 実装① UI作成
      // 1. 計算したいふたつの数字を入力するためのフォームを作成
      // 2. 四則演算のうちどの計算をするのか選択するためのフォームをプルダウン形式で作成
        // 選択項目には +, -, ×, ÷ を使用すること
      // 3. 計算ボタンを設置
      // 4. 回答が表示される部分をh2タグで設置

    // 実装② 足し算
      // プルダウンで「+」を選択した場合足し算を行うプログラムを作成

    // 実装③ 引き算
      // プルダウンで「-」を選択した場合引き算を行うプログラムを作成

    // 実装④ 掛け算
      // プルダウンで「×」を選択した場合掛け算を行うプログラムを作成

    // 実装⑤ 割り算
      // プルダウンで「÷」を選択した場合割り算を行うプログラムを作成

    // 実装⑥ バリデーション１
      // 計算したい数値を入れるフォームが空だった場合、エラーメッセージを表示して再度入力を求めるようにする

    // 実装⑦ バリデーション２
      // 計算したい数値を入れるフォームに数値以外の値が入ってきた場合、数値の入力を求めるエラーメッセージを表示する

    // 実装⑧ 入力内容保持
      // 入力されたデータが結果出力時にフォーム内に表示されている状態にする
?>
